Revit 2026 API

# StructuralSectionGeneralWTopWebFillet Property

---

Top Web Fillet - fillet radius at the top of web.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TopWebFillet { get; set; }
```
```vb
Public Property TopWebFillet As Double
	Get
	Set
```
```cpp
public:
property double TopWebFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member TopWebFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralW Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace